ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_spi.c
    spiIntCbfArra[spiNo][intType] = cbFun;

    return SUCCESS;
}
#endif

/****************************************************************************/ /**
 * @brief  SPI send datas
 *
 * @param  spiNo: SPI ID type
 * @param  buff: Buffer of datas
 * @param  length: Length of buffer
 * @param  timeoutType: Enable or disable timeout judgment
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type SPI_SendData(SPI_ID_Type spiNo, void *buff, uint32_t length, SPI_Timeout_Type timeoutType)
{
    uint32_t tmpVal;
    uint32_t txLen = 0;
    uint32_t rData;
    uint32_t frameSize = 0;
    uint32_t SPIx = spiAddr[spiNo];
    uint32_t timeoutCnt = SPI_TX_TIMEOUT_COUNT;

    /* Check the parameters */
    CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));
    CHECK_PARAM(IS_SPI_TIMEOUT_TYPE(timeoutType));

    /* Get fifo valid width */
    tmpVal = BL_RD_REG(SPIx, SPI_CONFIG);
    frameSize = BL_GET_REG_BITS_VAL(tmpVal, SPI_CR_SPI_FRAME_SIZE);

    switch (frameSize) {
        case 0:

            tmpVal = length <= (SPI_TX_FIFO_SIZE) ? length : SPI_TX_FIFO_SIZE;

            /* Fill tx fifo */
            for (; txLen < tmpVal; txLen++) {
                BL_WR_REG(SPIx, SPI_FIFO_WDATA, ((uint8_t *)buff)[txLen]);
            }

            /* Wait receive data and send the rest of the data */
            for (; txLen < length; txLen++) {
                timeoutCnt = SPI_RX_TIMEOUT_COUNT;

                while (BL_GET_REG_BITS_VAL(BL_RD_REG(SPIx, SPI_FIFO_CONFIG_1), SPI_RX_FIFO_CNT) == 0) {
                    if (timeoutType) {
                        timeoutCnt--;

                        if (timeoutCnt == 0) {
                            return TIMEOUT;
                        }
                    }
                }

                rData |= BL_RD_REG(SPIx, SPI_FIFO_RDATA);
                BL_WR_REG(SPIx, SPI_FIFO_WDATA, ((uint8_t *)buff)[txLen]);
            }

            /* Wait receive the rest of the data */
            for (txLen = 0; txLen < tmpVal; txLen++) {
                timeoutCnt = SPI_RX_TIMEOUT_COUNT;

                while (BL_GET_REG_BITS_VAL(BL_RD_REG(SPIx, SPI_FIFO_CONFIG_1), SPI_RX_FIFO_CNT) == 0) {
                    if (timeoutType) {
                        timeoutCnt--;

                        if (timeoutCnt == 0) {
                            return TIMEOUT;
                        }
                    }
                }

                rData |= BL_RD_REG(SPIx, SPI_FIFO_RDATA);
            }

            break;

        case 1:

            tmpVal = length <= (SPI_TX_FIFO_SIZE / 2) ? length : (SPI_TX_FIFO_SIZE / 2);

            /* Fill tx fifo */
            for (; txLen < tmpVal; txLen++) {
                BL_WR_REG(SPIx, SPI_FIFO_WDATA, ((uint16_t *)buff)[txLen]);
            }

            /* Wait receive data and send the rest of the data */
            for (; txLen < length; txLen++) {
                timeoutCnt = SPI_RX_TIMEOUT_COUNT;

                while (BL_GET_REG_BITS_VAL(BL_RD_REG(SPIx, SPI_FIFO_CONFIG_1), SPI_RX_FIFO_CNT) == 0) {
                    if (timeoutType) {
                        timeoutCnt--;

                        if (timeoutCnt == 0) {
                            return TIMEOUT;
                        }
                    }
                }

                rData |= BL_RD_REG(SPIx, SPI_FIFO_RDATA);
                BL_WR_REG(SPIx, SPI_FIFO_WDATA, ((uint16_t *)buff)[txLen]);
            }

            /* Wait receive the rest of the data */
            for (txLen = 0; txLen < tmpVal; txLen++) {
                timeoutCnt = SPI_RX_TIMEOUT_COUNT;

                while (BL_GET_REG_BITS_VAL(BL_RD_REG(SPIx, SPI_FIFO_CONFIG_1), SPI_RX_FIFO_CNT) == 0) {
                    if (timeoutType) {
                        timeoutCnt--;

                        if (timeoutCnt == 0) {
                            return TIMEOUT;
                        }
                    }
                }

                rData |= BL_RD_REG(SPIx, SPI_FIFO_RDATA);
            }

            break;

        case 2:

        /* Same as case 3 */
        case 3:

            tmpVal = length <= (SPI_TX_FIFO_SIZE / 4) ? length : (SPI_TX_FIFO_SIZE / 4);

            /* Fill tx fifo */
            for (; txLen < tmpVal; txLen++) {
                BL_WR_REG(SPIx, SPI_FIFO_WDATA, ((uint32_t *)buff)[txLen]);
            }

            /* Wait receive data and send the rest of the data */
            for (; txLen < length; txLen++) {
                timeoutCnt = SPI_RX_TIMEOUT_COUNT;

                while (BL_GET_REG_BITS_VAL(BL_RD_REG(SPIx, SPI_FIFO_CONFIG_1), SPI_RX_FIFO_CNT) == 0) {
                    if (timeoutType) {
                        timeoutCnt--;

                        if (timeoutCnt == 0) {
                            return TIMEOUT;
                        }
                    }
                }

                rData |= BL_RD_REG(SPIx, SPI_FIFO_RDATA);
                BL_WR_REG(SPIx, SPI_FIFO_WDATA, ((uint32_t *)buff)[txLen]);
            }

            /* Wait receive the rest of the data */
            for (txLen = 0; txLen < tmpVal; txLen++) {
                timeoutCnt = SPI_RX_TIMEOUT_COUNT;

                while (BL_GET_REG_BITS_VAL(BL_RD_REG(SPIx, SPI_FIFO_CONFIG_1), SPI_RX_FIFO_CNT) == 0) {
                    if (timeoutType) {
                        timeoutCnt--;

                        if (timeoutCnt == 0) {
                            return TIMEOUT;
                        }
                    }
                }

                rData |= BL_RD_REG(SPIx, SPI_FIFO_RDATA);
            }

            break;

        default:
            break;
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  SPI receive datas
 *
 * @param  spiNo: SPI ID type
 * @param  buff: Buffer of datas
 * @param  length: Length of buffer
 * @param  timeoutType: Enable or disable timeout judgment
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type SPI_ReceiveData(SPI_ID_Type spiNo, void *buff, uint32_t length, SPI_Timeout_Type timeoutType)
{
    uint32_t tmpVal;
    uint32_t rxLen = 0;
    uint32_t frameSize = 0;
    uint32_t SPIx = spiAddr[spiNo];
    uint32_t timeoutCnt = SPI_RX_TIMEOUT_COUNT;

    /* Check the parameters */
    CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));
    CHECK_PARAM(IS_SPI_TIMEOUT_TYPE(timeoutType));

    /* Get fifo valid width */
    tmpVal = BL_RD_REG(SPIx, SPI_CONFIG);
    frameSize = BL_GET_REG_BITS_VAL(tmpVal, SPI_CR_SPI_FRAME_SIZE);

